import numpy as np
# 單維度的資料
print("---------------------單維度的資料-------------------------")
data = np.array([1, 5, 2, 10])
print(data[1])

# 多維度的資料
print("---------------------多維度的資料-------------------------")
data = np.array([
    [1, 2],
    [3, 4],
    [5, 6]
])
print(data[0, 1])
print(data[1, 0])
print(data[2, 0])

# 單維度的切片
print("---------------------單維度的切片-------------------------")
data = np.array([1, 2, 3, 4])
print(data[0:3])
print(data[:2])
print(data[2:])

# 多維度的切片
print("---------------------多維度的切片-------------------------")
data = np.array([
    [0, 1, 2], [3, 4, 5], [6, 7, 8], [9, 10, 11]
])
print(data[1:3, 0:2])
print(data[0:3, 2])

# 使用...代表全都要
print("---------------------使用...代表全都要-------------------------")
data = np.array([
    [
        [1, 2, 3], [4, 5, 6]
    ],
    [
        [7, 8, 9], [10, 11, 12]
    ]
])
print(data[0, ...])
print(data[..., 0:2])
